// prettier-ignore
export const lastNames = ["赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许", "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳", "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常", "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹", "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", "明", "臧", "计", "伏", "成", "戴", "谈", "宋", "茅", "庞", "熊", "纪", "舒", "屈", "项", "祝", "董", "梁", "杜", "阮", "蓝", "闵", "席", "季", "麻", "强", "贾", "路", "娄", "危", "江", "童", "颜", "郭", "梅", "盛", "林", "刁", "钟", "徐", "邱", "骆", "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍", "虞", "万", "支", "柯", "昝", "管", "卢", "莫", "经", "房", "裘", "缪", "干", "解", "应", "宗", "丁", "宣", "贲", "邓", "郁", "单", "杭", "洪", "包", "诸", "左", "石", "崔", "吉", "钮", "龚", "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁", "荀", "羊", "於", "惠", "甄", "曲", "家", "封", "芮", "羿", "储", "靳", "汲", "邴", "糜", "松", "井", "段", "富", "巫", "乌", "焦", "巴", "弓", "牧", "隗", "山", "谷", "车", "侯", "宓", "蓬", "全", "郗", "班", "仰", "秋", "仲", "伊", "宫", "宁", "仇", "栾", "暴", "甘", "钭", "厉", "戎", "祖", "武", "符", "刘", "景", "詹", "束", "龙", "叶", "幸", "司", "韶", "郜", "黎", "蓟", "薄", "印", "宿", "白", "怀", "蒲", "邰", "从", "鄂", "索", "咸", "籍", "赖", "卓", "蔺", "屠", "蒙", "池", "乔", "阴", "鬱", "胥", "能", "苍", "双", "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄", "姬", "申", "扶", "堵", "冉", "宰", "郦", "雍", "郤", "璩", "桑", "桂", "濮", "牛", "寿", "通", "边", "扈", "燕", "冀", "郏", "浦", "尚", "农", "温", "别", "庄", "晏", "柴", "瞿", "阎", "充", "慕", "连", "茹", "习", "宦", "艾", "鱼", "容", "向", "古", "易", "慎", "戈", "廖", "庾", "终", "暨", "居", "衡", "步", "都", "耿", "满", "弘", "匡", "国", "文", "寇", "广", "禄", "阙", "东", "欧", "殳", "沃", "利", "蔚", "越", "夔", "隆", "师", "巩", "厍", "聂", "晁", "勾", "敖", "融", "冷", "訾", "辛", "阚", "那", "简", "饶", "空", "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰", "巢", "关", "蒯", "相", "查", "後", "荆", "红", "游", "竺", "权", "逯", "盖", "益", "桓", "公", "万俟", "司马", "上官", "欧阳", "夏侯", "诸葛", "闻人", "东方", "赫连", "皇甫", "尉迟", "公羊", "澹台", "公冶", "宗政", "濮阳", "淳于", "单于", "太叔", "申屠", "公孙", "仲孙", "轩辕", "令狐", "钟离", "宇文", "长孙", "慕容", "鲜于", "闾丘", "司徒", "司空", "亓官", "司寇", "仉", "督", "子车", "颛孙", "端木", "巫马", "公西", "漆雕", "乐正", "壤驷", "公良", "拓跋", "夹谷", "宰父", "谷梁", "晋", "楚", "闫", "法", "汝", "鄢", "涂", "钦", "段干", "百里", "东郭", "南门", "呼延", "归", "海", "羊舌", "微生", "岳", "帅", "缑", "亢", "况", "后", "有", "琴", "梁丘", "左丘", "东门", "西门", "商", "牟", "佘", "佴", "伯", "赏", "南宫", "墨", "哈", "谯", "笪", "年", "爱", "阳", "佟", "第五", "言", "福"];
// prettier-ignore
export const maleFirstNames = ["建国", "建华", "国华", "和平", "明", "建平", "军", "平", "志明", "德明", "勇", "伟", "建军", "强", "斌", "刚", "涛", "波", "辉", "磊", "超", "鹏", "杰", "浩", "鑫", "帅", "俊杰", "宇", "浩宇", "浩然", "宇轩", "子轩", "宇航", "皓轩", "子豪", "浩轩", "子涵"];
// prettier-ignore
export const femaleFirstNames = ["秀英", "桂英", "秀兰", "玉兰", "桂兰", "秀珍", "凤英", "玉珍", "玉英", "兰英", "英", "萍", "红", "丽", "敏", "艳", "芳", "静", "霞", "红梅", "燕", "娟", "娜", "丹", "玲", "婷", "婷婷", "雪", "倩", "欣怡", "悦", "佳怡", "颖", "雨欣", "梓涵", "梓萱", "子涵", "紫涵", "雨涵", "一诺"];
// prettier-ignore
export const genders = ["男", "女"];
// prettier-ignore
export const enLastNames = ["Smith", "Johnson", "Williams", "Brown", "Jones", "Miller", "Davis", "Garcia", "Rodriguez", "Wilson", "Martinez", "Anderson", "Taylor", "Thomas", "Hernandez", "Moore", "Martin", "Jackson", "Thompson", "White", "Lopez", "Lee", "Gonzalez", "Harris", "Clark", "Lewis", "Robinson", "Walker", "Perez", "Hall", "Young", "Allen", "Sanchez", "Wright", "King", "Scott", "Green", "Baker", "Adams", "Nelson", "Hill", "Ramirez", "Campbell", "Mitchell", "Roberts", "Carter", "Phillips", "Evans", "Turner", "Torres"];
// prettier-ignore
export const enMaleFirstNames = ["Aiden", "Jacob", "Ethan", "Matthew", "Nicholas", "Jack", "Joshua", "Michael", "Ryan", "Andrew", "Caden", "Tyler", "Dylan", "Jaden", "Zachary", "Connor", "Logan", "Caleb", "Noah", "Alexande", "JacksonJACK", "Brayden", "Lucas", "William", "Nathan", "Joseph", "Justin", "Daniel", "Benjamin", "Christopher", "James", "Gavin", "Evan", "Austin", "Cameron", "Brandon", "Mason", "Luke", "Anthony", "Christian", "Gabriel", "Owen", "David", "John", "Jonathan", "Samuel", "Sean", "Hunter", "Elijah", "Thomas"];
// prettier-ignore
export const enFemaleFirstNames = ["Emily", "Madison", "Isabella", "Ava", "Sophia", "Kaitlyn", "Hannah", "Hailey", "Olivia", "Sarah", "Abigail", "Madeline", "Lily", "Kaylee", "Ella", "Riley", "Brianna", "Alyssa", "Samantha", "Lauren", "Mia", "Alexis", "Chloe", "Ashley", "Grace", "Jessica", "Elizabeth", "Taylor", "Makayla", "Makenzie", "Anna", "Zoe", "Kayla", "Sydney", "Megan", "Natalie", "Kylie", "Rachel", "Avery", "Katherine", "Isabel", "Victoria", "Morgan", "Kyra", "Jasmine", "Allison", "Savannah", "Julia", "Jordan"];
// prettier-ignore
export const enGenders = ["male", "female"];
// prettier-ignore
export const appellations = ["先生", "夫人", "女士", "小姐", "阁下", "医生", "教授", "法官", "律师", "博士"];
// prettier-ignore
export const maritalStatus = ["单身", "未婚", "已婚", "离异", "丧偶", "分居", "再婚"];
// prettier-ignore
export const professions = ["教师", "工人", "记者", "演员", "厨师", "医生", "护士", "司机", "军人", "律师", "商人", "会计", "店员", "出纳", "作家", "导游", "模特", "警察", "歌手", "画家", "裁缝", "翻译", "法官", "保安", "花匠", "服务员", "清洁工", "建筑师", "理发师", "采购员", "设计师", "消防员", "机修工", "推销员", "魔术师", "模特儿", "邮递员", "售货员", "救生员", "运动员", "工程师", "飞行员", "管理员", "机械师", "经纪人", "审计员", "漫画家", "园艺师", "科学家", "主持人"];
// prettier-ignore
export const emailDomains = ["gmail.com", "icloud.com", "outlook.com", "yahoo.com", "foxmail.com"];
// prettier-ignore
export const companyName = ["湖飞", "艾雷", "拓生", "诺诚", "妙祥", "宜百", "维帝", "营卓", "英和", "彩中", "翔士", "旋欧", "凡名", "用彩", "复海", "德缘", "亚速", "瑞全", "盛清", "浩长", "林贵", "南白", "佳华", "海跃", "盛禾", "莱东", "洁巨", "开纽", "森洲", "晶久", "生百", "尼康", "豪展", "荣财", "苏隆", "克环", "缘耀", "百正", "建胜", "吉派", "速南", "思亿", "展东", "迪太", "禾德", "白览", "码裕", "爱妙", "迪斯", "好智", "东安", "通源", "腾艾", "启浩", "坚火", "方吉", "天森", "太运", "辰凯", "同志", "双和", "航腾", "莱赛", "真成", "智码", "世亿", "成帝", "禾识", "浩广", "尼基", "豪览", "荣联", "苏缘", "大天", "览建", "龙高", "木同", "惠相", "伟信", "鑫林", "帝卓", "凌营", "贵讯", "信览", "倍语", "铁啸", "派天", "安圣", "友百", "拓月", "驰雷", "欣宇", "富理", "特立", "坚广", "方至", "天佩", "太湖", "辰永", "同罗", "双发", "高傲", "林诺", "汉霸", "宜佳", "顿科", "远宏", "精浩", "信利", "汉方", "诗卓", "新凤", "系川", "娇尼", "派瑞", "妙鑫", "宜森", "科真", "裕迪", "网志", "友欣", "耀优", "微豪", "原梦", "胜白", "洁太", "开霸", "全新", "能鑫", "生盈", "格威", "尼曼", "豪立", "荣奥", "苏事", "克英", "缘春", "发佩", "贝龙", "东语", "莱越", "语实", "润格", "玛润", "贝华", "达坚", "川尔", "益利", "美赛", "迪丝", "好迎", "东鸿", "通信", "复理", "德扬", "森贝", "克飞", "启茂", "仕集", "翔宝", "力庆", "日环", "创晶", "启万", "士尚", "界纽", "佳迪", "帝扬", "良原", "凤迪", "仕康", "诗双", "湖财", "艾隆", "拓时", "诺耀", "英系", "旭宇", "风理", "力益", "网仕", "奇韦", "福美", "洲大", "金白", "胜庆", "跃佳", "利星", "营贸", "本立", "拓格", "驰茂", "欣倍", "浩斯", "营恒", "森界", "霸电", "欣财", "京庆", "丝环", "易名", "本腾", "高铭", "士银", "界邦", "邦特", "事微", "旺识", "隆皇", "原飞", "全庆", "立宝", "艾梦", "拓速", "诺硕", "妙清", "宜爱", "康志", "运威"];
// prettier-ignore
export const businessScope = ["文化传播", "房地产中介", "物流", "教育发展", "商务咨询", "餐饮管理", "知识产权咨询服务", "广告", "进出口", "贸易", "财务咨询", "电子商务", "网络科技", "通信科技", "信息科技", "房地产投资咨询", "室内装饰设计", "清洁服务", "医疗器械科技", "会计师事务所", "税务师事务所", "国际货运代理", "电影电视制作", "农药工业", "国际船舶代理", "电能发展", "航空服务", "通信发展", "轻工科技", "空调工程", "物业管理", "光纤通信科技", "国际公共关系服务", "绿色食品", "投资咨询", "市场经营管理", "企业管理", "教育科技", "电梯", "土建工程咨询", "环保科技"];
// prettier-ignore
export const companyTypes = ["有限责任公司", "股份有限公司"];
// prettier-ignore
export const topCities = ["上海市", "北京市", "广州市", "深圳市", "天津市", "苏州市", "重庆市", "杭州市", "无锡市", "成都市", "武汉市", "青岛市", "佛山市", "大连市", "南京市", "宁波市", "沈阳市", "长沙市", "唐山市", "郑州市", "烟台市", "东莞市", "济南市", "泉州市", "哈尔滨市", "石家庄市", "南通市", "长春市", "西安市", "大庆市", "福州市", "合肥市", "常州市", "徐州市", "潍坊市", "温州市", "绍兴市", "淄博市", "鄂尔多斯市", "包头市", "济宁市", "邯郸市", "盐城市", "临沂市", "台州市", "洛阳市", "南昌市", "嘉兴市", "东营市", "扬州市"];
// prettier-ignore
export const departments = ["总公司", "分公司", "营业部", "人事部", "人力资源部", "总务部", "财务部", "销售部", "促销部", "国际部", "出口部", "进口部", "公共关系", "广告部", "企划部", "产品开发部", "研发部", "秘书室", "采购部", "工程部", "行政部", "人力资源部", "市场部", "技术部", "客服部", "行政部", "财务部", "总经理室", "副总经理室", "总经办", "采购部", "工程部", "研发部", "生产部", "销售部", "广东业务部", "无线事业部", "拓展部", "物供部"];
// prettier-ignore
export const industries = ["农业", "林业", "牧业", "渔业", "矿业", "制造业", "电力、燃气及水的生产和供应业", "建筑业", "交通运输、仓储和邮政业", "信息传输、计算机服务和软件业", "批发和零售业", "住宿和餐饮业", "金融业", "房地产业", "租赁和商务服务业", "科学研究、技术服务和地质勘查业", "水利、环境和公共设施管理业", "居民服务和其他服务业", "教育，卫生、社会保障和社会福利业", "文化、体育和娱乐业", "公共管理和社会组织", "国际组织"];
// prettier-ignore
export const regions = ["华北区", "东北区", "西北区", "华东区", "中南区", "西南区"];
// prettier-ignore
export const productCategories = [ "家用电器", "手机", "运营商", "数码", "电脑", "办公", "文具用品", "家居", "家具", "家装", "厨具", "男装", "女装", "童装", "内衣", "美妆", "个护清洁", "宠物", "女鞋", "箱包", "钟表", "珠宝", "男鞋", "运动", "户外", "房产", "汽车", "汽车用品", "母婴", "玩具乐器", "食品", "酒类", "生鲜", "特产", "艺术", "礼品鲜花", "农牧园艺", "京东买药", "计生情趣", "图书", "文娱", "教育", "电子书", "机票", "酒店", "旅游", "生活", "支付", "白条", "保险", "企业金融", "安装", "维修", "清洗", "二手", "元器件", "原材料", "五金机电"];
// prettier-ignore
export const productNames = ["信元", "卓沃", "兆能", "视显", "尚昱", "诺鑫", "银声", "德立", "多科", "科黎", "科奥", "富源", "科尔", "飞春", "同创", "爱为", "宏泰", "诺科", "纬智", "蓝赛", "连联", "青世", "铭达", "赛盛", "升隆", "协汇", "睿君", "道胜", "赛诚", "金领", "宁首", "赫思", "纬亚", "科艾", "迪亚", "贝尔", "六草", "史阿", "百润", "美光", "聚成", "宜扬", "祝轩", "巴图", "美歌"];
// prettier-ignore
export const colors = ["白色", "红色", "绿色", "蓝色", "牡丹红", "青色", "黄色", "黑色", "海蓝", "巧克力色", "蓝紫色", "黄铜色", "亮金色", "棕色", "青铜色", "号青铜色", "士官服蓝色", "冷铜色", "铜色", "珊瑚红", "紫蓝色", "深棕", "深绿", "深铜绿色", "深橄榄绿"];
// prettier-ignore
export const sizes = ["加加细码", "加细码", "细码", "中码", "大码", "加大码", "加加大码"];

export const numbers = "0123456789";
export const numbersx = "0123456789x";
export const numbers16 = "0123456789abcdef";
export const lowerLetters = "abcdefghijklmnopqrstuvwxyz";
export const upperLetters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
export const letters = upperLetters + lowerLetters;

// prettier-ignore
export const extensions = ["jpg", "png", "txt", "rtf", "pdf", "docx", "xlsx", "csv", "html", "zip"];

// prettier-ignore
export const topLevelDomains = ["biz", "com", "cn", "info", "jp", "net", "org", "us", "xyz"];

// prettier-ignore
export const threeLevelDomains = ["auth", "drive", "image", "video", "www", "admin", "developer"];
